[
  {
    "title": "E-Portfolio Website | React",
    "description": "Designed and developed a responsive personal portfolio using React, showcasing projects, skills and experience in web development, data analytics, and cloud computing. Deployed through AWS Amplify",
    "tech": ["React", "HTML", "CSS", "JavaScript"],
    "images": []
  },
  {
    "title": "Banking System Simulation | Cloud-based Infrastructure",
    "description": "Working with a team to design and deploy a scaled-down banking system with deposits, withdrawals, account management, and secure user data storage. Simulating real-world transactions in AWS with a React frontend, SQL backend, and RESTful APIs. Leveraging Terraform for Infrastructure as Code (IaC), and applying data analytics to monitor transaction patterns, generate performance dashboards, and identify anomalies. Gaining proficiency in AWS services, database management, and cloud security best practices",
    "tech": ["AWS", "Terraform", "React", "SQL"],
    "images": []
  },
  {
    "title": "Product Performance Dashboard | SQL -> PowerBI",
    "description": "End to end SQL Database to Power BI interactive dashboard using mock company product data. In a SQL server I imported 3 different files, then created a CTE to calculate the total revenue, cost, discounts, and date breakdown. I then joined the sales data with discount data. In PowerBI, I imported the sql database, then created an interactive product dashboard visualizing a variety of statistics.",
    "tech": ["Excel", "SQL", "PowerBI"],
    "images": ["/images/bidash.png"]
  },
  {
    "title": "Business Performance Analysis | Excel",
    "description": "Analyzed AI-generated business datasets using Excel. Cleaned and organized data, created dynamic visualizations, and compiled a detailed insights report summarizing key operational trends.",
    "tech": ["Excel", "Microsoft Word"],
    "images": ["/images/exceldata.png", "/images/cbsa.png"]
  },
  {
    "title": "24/7 Cloud Based Discord Music Bot",
    "description": "Developed a headless 24/7 Discord Music bot on a Linux Mint powered Thinkpad T410. I leveraged AWS S3 for secure music file storage, with automated syncing scripts that check for new uploads and download them locally for playback. Implemented cloud storage access, data handling, and secure file transferring. I also designed a React web interface with a Python Flask backend to allow authenticated users to upload tracks directly to the S3 bucket.",
    "tech": ["AWS S3", "Python", "Linux Mint", "Bash", "React", "Cloud security"],
    "images": ["/images/mbox1.png", "/images/mbox2.png"]
  },
  {
    "title": "Mintpal | Local AI Agent",
    "description": "Deployed an offline AI assistant using Ollama, OpenWebUI, and the Qwen3 model. Indexed Wikipedia PDFs, Linux/Mint documentation, and other sources in a vector database with a retrieval-augmented generation (RAG) setup for quick, accurate answers. Gained hands-on experience in NLP, machine learning workflows, and AI deployment on local hardware.",
    "tech": ["Ollama", "qwen3", "Bash", "Docker", "Openwebui"],
    "images": []
  }
]
